In [1]:
try:
    b = open('data.csv','x')
    b.close()
except:
    print("The file is already there.")

In [2]:
import csv
csvfile = open('data.csv')
reader = csv.DictReader(csvfile)
for row in reader:
    print(row)

OrderedDict([('Name', 'Ram'), ('Age', '67'), ('Address', 'Kathmandu'), ('Phone', '9856554543')])
OrderedDict([('Name', 'Shyam'), ('Age', '34'), ('Address', 'Patan'), ('Phone', '9856554543')])
OrderedDict([('Name', 'Hari'), ('Age', '23'), ('Address', 'Bara'), ('Phone', '9856554543')])
OrderedDict([('Name', 'Nabin'), ('Age', '34'), ('Address', 'Simara'), ('Phone', '9856554543')])
OrderedDict([('Name', 'Rita'), ('Age', '23'), ('Address', 'Nagarkot'), ('Phone', '9856554543')])
OrderedDict([('Name', 'Sabita'), ('Age', '45'), ('Address', 'Bhaktapur'), ('Phone', '9845445443')])

In [5]:
import pandas as pd
df = pd.read_csv('data.csv')
df

     Name  Age    Address       Phone
0     Ram   67  Kathmandu  9856554543
1   Shyam   34      Patan  9856554543
2    Hari   23       Bara  9856554543
3   Nabin   34     Simara  9856554543
4    Rita   23   Nagarkot  9856554543
5  Sabita   45  Bhaktapur  9845445443

In [6]:
# pip install pandas
# pip3 install pandas

In [7]:
import pandas as pd
df = pd.read_csv('data.csv',nrows = 3)
df

    Name  Age    Address       Phone
0    Ram   67  Kathmandu  9856554543
1  Shyam   34      Patan  9856554543
2   Hari   23       Bara  9856554543

In [11]:
import pandas as pd
df = pd.read_csv('data.csv')
# df.head()
df.tail(3)

     Name  Age    Address       Phone
3   Nabin   34     Simara  9856554543
4    Rita   23   Nagarkot  9856554543
5  Sabita   45  Bhaktapur  9845445443

In [12]:
import pandas as pd
df = pd.read_csv('data.csv',index_col = 'Sn')
df

      Name  Age    Address       Phone
Sn
1      Ram   67  Kathmandu  9856554543
2    Shyam   34      Patan  9856554543
3     Hari   23       Bara  9856554543
4    Nabin   34     Simara  9856554543
5     Rita   23   Nagarkot  9856554543
6   Sabita   45  Bhaktapur  9845445443

In [14]:
import pandas as pd
df = pd.read_csv('data.csv',index_col = 'Sn')
df.iloc[1:5,0:3]

     Name  Age   Address
Sn
2   Shyam   34     Patan
3    Hari   23      Bara
4   Nabin   34    Simara
5    Rita   23  Nagarkot

In [15]:
import pandas as pd
df = pd.read_csv('data.csv',index_col = 'Sn')
df.loc[2:5]

     Name  Age   Address       Phone
Sn
2   Shyam   34     Patan  9856554543
3    Hari   23      Bara  9856554543
4   Nabin   34    Simara  9856554543
5    Rita   23  Nagarkot  9856554543

In [18]:
import pandas as pd
df = pd.read_csv('data.csv',index_col = 'Name')
df.loc["Shyam":"Rita"]

       Sn  Age   Address       Phone
Name
Shyam   2   34     Patan  9856554543
Hari    3   23      Bara  9856554543
Nabin   4   34    Simara  9856554543
Rita    5   23  Nagarkot  9856554543

In [25]:
import pandas as pd
df = pd.read_csv('data.csv',index_col = 'Sn')
df[df['Age']>30]

      Name  Age    Address       Phone
Sn
1      Ram   67  Kathmandu  9856554543
2    Shyam   34      Patan  9856554543
4    Nabin   34     Simara  9856554543
6   Sabita   45  Bhaktapur  9845445443

In [26]:
import pandas as pd
df = pd.read_csv('data.csv',index_col = 'Sn')
df[df['Address']=="Kathmandu"]

   Name  Age    Address       Phone
Sn
1   Ram   67  Kathmandu  9856554543

In [29]:
import pandas as pd
df = pd.read_csv('data.csv',index_col = 'Name',usecols = ['Name','Address'])
df

          Address
Name
Ram     Kathmandu
Shyam       Patan
Hari         Bara
Nabin      Simara
Rita     Nagarkot
Sabita  Bhaktapur

In [33]:
import pandas as pd
df = pd.read_csv('data.csv',index_col = 'Sn')
df1 = df[(df['Age']>20) & (df['Address'] == 'Kathmandu')]
df1.to_csv('df1.csv')

In [34]:
type(df1)

pandas.core.frame.DataFrame

In [38]:
import csv   
fields=[7,"Hari",78,"Kathmandu",9856554543,"\n"]
f = open('data.csv', 'a')
x = csv.writer(f)
x.writerow(fields)
f.close()

In [39]:
a = [["Name","Price","Quantity","Total"],['Apple', 100, 2, 200], 
     ['Banana', 200, 3, 600], ['milk', 100, 3, 300]]

import csv   
f = open('data1.csv', 'a')
x = csv.writer(f)
for i in a:
    x.writerow(i)
f.close()

In [ ]:
DictWriter()
DataFrame()